{
  "section": "Software",
  "description": "Software development, web applications, and data analysis projects",
  "statusColors": {
    "LIVE": "#22c55e",
    "IN DEVELOPMENT": "#f59e0b",
    "PLANNING": "#3b82f6",
    "COMPLETED": "#10b981",
    "ON HOLD": "#ef4444",
    "BETA": "#8b5cf6",
    "ARCHIVED": "#6b7280"
  },
  "projects": [
    {
      "id": "team-website",
      "title": "This Website!",
      "description": "We program and upkeep this website with custom code!",
      "image": "media/cover/front.png",
      "status": "LIVE",
      "technologies": ["HTML", "JavaScript", "CSS"],
      "content": "A comprehensive web application for managing team activities, project timelines, and resource allocation. The platform includes features for task management, document sharing, and progress tracking to keep our team organized and efficient."
    },
    {
      "id": "puddle-ui",
      "title": "Puddle-UI",
      "description": "A custom in-car UI for telemetry, controls, and driver feedback",
      "status": "IN DEVELOPMENT",
      "technologies": ["Python"],
      "content": "Coming soon."
    },
    {
      "id": "lmp-optimizer",
      "title": "LMP-Optimizer",
      "description": "A web-based calculator that optimizes metal purchasing decisions to minimize costs and waste",
      "image": "/projects/media/2.png",
      "status": "LIVE",
      "technologies": ["HTML", "JavaScript", "CSS", "Algorithm"],
      "content": "The Linear Metal Part Optimizer uses advanced algorithms to determine the most cost-effective combination of metal lengths to purchase while providing detailed cutting plans. This tool helps teams minimize material waste and optimize purchasing decisions."
    },
    {
      "id": "puddles-bot",
      "title": "Puddles Discord Bot",
      "description": "A comprehensive Discord bot featuring task management, leveling systems, music streaming, and AI chat",
      "image": "/projects/media/3.png",
      "status": "BETA",
      "technologies": ["Python", "Discord.py", "SQLite", "AI/ML"],
      "content": "PuddlesBot is a feature-rich Discord bot built with modern Python and Discord.py. It includes task management with multi-assignee support, dual XP leveling systems, high-quality music streaming via Vocard & Lavalink, interactive messages with persistent buttons, invite tracking analytics, AI chat capabilities, and cross-server communication through the OpenChat system."
    }
  ]
}
